"OK" = "OK";
"CANCEL" = "Cancel";
"REPLACE" = "Replace";
"DELETE" = "Delete";
"DISABLE" = "Disable";
"UNKNOWN" = "Unknown";
"NEVER" = "Never";
"ERROR" = "Error";
"CONTINUE" = "Continue";

"SELECT_APP_PANEL_TITLE" = "Select an Application";
"SELECT_DIR_PANEL_TITLE" = "Select a Folder";

"SELECT" = "Select";
"NONE_FOUND" = "No Applications Found.";
"UNKNOWN_ERROR" = "Unknown Error";

"ITOOLS_ACCOUNT_NAME_IS_EMPTY" = "You have not entered your .Mac membership information. Please enter this information now.";
"ITOOLS_ACCOUNT_NAME_IS_EMPTY_DESC" = "After providing your .Mac membership information, go to the Email tab and click the \"Use .Mac Email account\" checkbox again.";

"EMAIL_ACCOUNTINFO_WILL_BE_ERASED" = "You have specified information for another email account. Are you sure you want to replace it with your .Mac email account?";
"EMAIL_ACCOUNTINFO_WILL_BE_ERASED_DESC" = "The information for the other email account will not be saved.";

"ITOOL_SIGN_UP_URL" = "http://www.apple.com./itools/signup/english.html";

"DOWNLOAD_FILE_DISPLAY" = "\"%@\" on volume \"%@\"";

"ON_YOUR_DESKTOP" = "My Desktop";
"IN_YOUR_DOCUMENTS" = "My Documents";

/* iDisk mirror strings */
"IDISK_MIRROR_TITLE" = "You have changed the %@ membership. Synchronizing the iDisk for %@@%@ will be turned on.";
"IDISK_MIRROR_TITLE_2" = "You have removed the %@ account info for %@@%@.";
"IDISK_MIRROR_INFO" = "The local copy of the iDisk that belongs to %@@%@ has been moved to the desktop because it is no longer active.";
"MIRROR_WARNING_TITLE" = "Are you sure you want to turn off the local iDisk for %@@mac.com?";
"MIRROR_WARNING_INFO" = "The local iDisk for %@@mac.com will be moved to the desktop.";
"MIRROR_DEFAULT_BUTTON" = "Turn Off Local iDisk";
"MIRROR_CANCEL_BUTTON" = "Cancel";
"NOT_MOUNTED" = "Not Mounted";
"STOP_BUTTON" = "Stop";
"START_BUTTON" = "Start";
"OFF_STATUS" = "iDisk Sync: Off";
"ON_STATUS" = "iDisk Sync: On";
"STARTING_UP_STATUS" = "iDisk Sync Starting…";
"TURNING_OFF_STATUS" = "iDisk Sync Stopping…";
"MIRROR_OFF_INFORMATIVE" = "Click Start to keep a copy of your iDisk on this computer, so you can access it even when you’re not connected to the Internet.";
"MIRROR_ON_INFORMATIVE" = "Click Stop to return to using your Internet-based iDisk. You will be able to access your iDisk only when you’re connected to the Internet.";
"MIRROR_GENERAL_INFORMATIVE" = "iDisk Sync allows you to use your iDisk at all times, even when you’re not connected to the Internet.";

/* Services unavailable sheets */
"IDISK_UPGRADE_TITLE" = "iDisk Unavailable";
"IDISK_UPGRADE" = "Upgrade to a full %@ subscription to use iDisk.";
"SYNC_UPGRADE_TITLE" = "This %@ account is not authorized to synchronize to %@.";
"SYNC_UPGRADE_MESSAGE" = "Upgrade to a full %@ subscription to take advantage of the %@ synchronization services.";
"SHARING_UPGRADE_TITLE" = "Sharing Unavailable";
"SHARING_UPGRADE_MESSAGE" = "Sorry, your .Mac account is not authorized to use this feature. Upgrade now to a full .Mac membership to enable this feature.";
"ADVANCED_TAB_UPGRADE_TITLE" = "Features Unavailable";
"ADVANCED_TAB_UPGRADE_MESSAGE" = "Sorry, your .Mac account is not authorized to use these features. Upgrade now to a full .Mac membership to enable these features.";
"UPGRADE_BUTTON" = "Upgrade";
"NOT_YET" = "Close";
"UPGRADE_URL" = "https://secure.me.com/wo/WebObjects/Signup.woa/wa/upgrade?lang=en"; /* must be localized */


/* iDisk Error Strings */
"NO_ACCESS_ALERT" = "Unable to access your %@ account.";
"SERVER_ERROR" = "An error was returned from the server. Please try again later.";
"NOT_AUTHORIZED" = "Your %@ member name or password may be invalid. Please enter a different name or password.";
"GENERAL_ERROR" = "There’s a problem connecting to the iDisk server at this time. Please try again later. You may continue to work offline on your local iDisk.";
"SERVER_NOT_FOUND" = "There’s a problem connecting to the required iDisk server. Please try again later. You may continue to work offline on your local iDisk.";
"GENERAL_FAILURE" = "There’s a problem connecting to the required iDisk server at this time. Please try again later. You may continue to work offline on your local iDisk.";
"CANNOT_COMMIT" = "Your options can’t be changed at this time.";
"MISSING_INFO" = "Your %@ account could not be accessed because your member name or password is missing. Sign out and sign in again to access %@.";
"OPERATION FAILED" = "Operation Failed";

/* Password Error Strings */
"PASSWORD_ALERT" = "The password and confirmation password aren’t the same. Please try again.";
"BAD_PASSWORD" = "Passwords can only consist of letters (a-z or A-Z), numbers (0-9), and marks (!\"#$%&'()*+,-./:;<=>?@[\\]^_`{|}). Please enter a different password.";
"BAD_PASSWORD_LENGTH" = "Passwords must be from 6 to 20 characters long. Please enter a different password.";
"BAD_PASSWORD_ENDS_IN_PERIOD" = "Passwords must not end with a period. Please enter a different password.";
"BAD_PASSWORD_TWO_PERIODS" = "Passwords must not contain two periods adjacent to each other. Please enter a different password.";
"SAME_PASSWORD" = "Your Public folder password cannot be the same as your %@ password. Please enter a different password.";
"EMPTY_PASSWORD" = "The password cannot be blank. Please enter a password.";
"KEYCHAIN_ERROR_TITLE" = "Keychain Error.";
"KEYCHAIN_ERROR_MESSAGE" = "There was a problem saving to your keychain. Try again or use Keychain Access to verify your keychain.";

/* Marketing Error Sheet Info */
"WILL_EXPIRE" = "Your %@ trial membership will expire in %d day(s).";
"WILL_EXPIRE_INFO" = "Your iDisk will stop working when your %@ trial membership expires. Sign up for a %@ membership and enjoy the benefits of a larger iDisk, expanded backup functionality, and more.";
"HAS_EXPIRED" = "Your %@ trial membership has expired.";
"HAS_EXPIRED_INFO" = "Since your %@ trial membership has expired, your iDisk has been deactivated. Sign-up for a %@ membership and enjoy the benefits of a larger iDisk, expanded backup functionality, and more.";

/* iDisk Strings */
"BUY_SPACE_URL" = "https://secure.me.com/account/#buymore";
"SIGN_UP_URL" = "http://www.apple.com/mobileme/";

"ITOOLS_KEYCHAIN_COMMENT" = "This is the keychain item for .Mac membership %@.";
"NONE" = "None";

"KILO_FMT" = "%d K";
"MEGA_FMT" = "%d MB";
"GIGA_FMT" = "%d GB";
"GIGA_FLOAT_FMT" = "%.2f GB";
"QUOTA_FMT" = "%@ total, %@ used, %@ available";
"AX_DESCR_FOR_IDISK_QUOTA" = "iDisk quota";


"ALREADY_ON_KEYCHAIN_MESSAGE" = "The imported item already exists on the login keychain. Please use the Keychain Access application to move or delete any conflicting private keys or certificates.";

/* alert prompt for trying to enable NAT-PMP mode */
"NATPMP_CONFIGURE_PROMPT" = "%@ performance is currently reduced on the AirPort Base Station named \"%@\".\n\nWould you like to configure it for optimal performance?";
"NATPMP_FAILED_TITLE" = "NAT Port Mapping Protocol couldn’t be enabled on the Apple wireless device.";
"NATPMP_FAILED_MESSAGE" = "Make sure the Apple wireless device supports NAT Port Mapping Protocol. Use AirPort Utility, located in Applications > Utilities for more information.";
"NATPMP_SUCCESS_TITLE" = "NAT Port Mapping Protocol has been enabled.";
"NATPMP_SUCCESS_MESSAGE" = "Wait for the Apple wireless device to restart before continuing.";
"INCORRECT_PASSWORD_TITLE" = "Incorrect Password"; /* also used for airport nat-pmp configuring */
"INCORRECT_PASSWORD_MESSAGE" = "The password you entered is incorrect. Please try again.";
/* progress indicator status for configuring airport */
"READING_AIRPORT_CONFIG" = "Reading AirPort Base Station configuration";
"UPDATING_AIRPORT_FIRMWARE" = "Updating AirPort Base Station firmware";

"AIRPORT_UNKNOWN_ERROR" = "An unknown error occurred while reading the AirPort wireless device configuration. Please try again.";
"AIRPORT_PASSWORD_INVALID_MESSAGE" = "The AirPort wireless device password you entered is incorrect. Please try again.";
"ALREADY_ENABLED_TITLE" = "Already Enabled";
"ALREADY_ENABLED_MESSAGE" = "NAT Port Mapping Protocol appears to be enabled on the AirPort wireless device already.";
"UNSUPPORTED_OPERATION_TITLE" = "Unsupported Operation";
"UNSUPPORTED_OPERATION_MESSAGE" = "Sorry, this AirPort wireless device does not support NAT Port Mapping Protocol that allows MobileMe to find your computer behind a firewall.";

/* Getting the base station password */
"ABS_PROMPT_TEXT" = "Enter the password for the base station named\n%@:";

/* Account status strings */
"ACCOUNT_STATUS_TITLE" = "Sign Up Now";
"ACCOUNT_STATUS_MESSAGE" = "Get the suite of Internet essentials for your Mac. Click Learn More for a 60-day trial.";
"SIGN_UP_BUTTON" = "Sign Up";
"LEARN_MORE_BUTTON" = "Learn More";

/* Sign out alert */
"SIGN_OUT_ALERT_TITLE" = "Are you sure you want to sign out of %@?";
"SIGN_OUT_ALERT_MESSAGE" = "If you sign out, %@ Sync, iDisk Sync, and other %@ services might not be available on this computer until you sign in again.";
"SIGN_OUT_ALERT_DEFAULT_BUTTON" = "Sign Out";
"SIGN_OUT_ALERT_CANCEL_BUTTON" = "Cancel";

/* Sign in not on network */
"SIGN_IN_NETWORK_DIAGNOSTICS_ALERT_SAVE" = "Save";
"SIGN_IN_NETWORK_DIAGNOSTICS_ALERT_DIAG" = "Network Diagnostics…";
"SIGN_IN_NETWORK_DIAGNOSTICS_ALERT_TITLE" = "You’re not connected to the Internet.";
"SIGN_IN_NETWORK_DIAGNOSTICS_ALERT_MESSAGE" = "You can’t sign into %@ unless you’re connected to the Internet. Click Network Diagnostics if you’re having trouble connecting, or click Save to save your %@ member name and password for the next time you connect.";

/* Tab item labels that can change dynamically */
"ACCOUNT" = "Account";
"SIGN IN" = "Sign In";

/* Back To My Mac string */
"BTMM_STATUS_ENABLED" = "Back to My Mac: On";
"BTMM_STATUS_DISABLED" = "Back to My Mac: Off";
"BTMM_STATUS_TRANSIENT" = "Back to My Mac: Starting…";
"BTMM_STATUS_START" = "Turn On Back to My Mac";
"BTMM_STATUS_STOP" = "Turn Off Back to My Mac";
"BTMM_START_BUTTON_SHOWING_TEXT" = "Click Stop to turn off Back to My Mac for this user. You will no longer be able to access this computer from other computers using Back to My Mac.";
"BTMM_STOP_BUTTON_SHOWING_TEXT" = "Click Start to turn on Back to My Mac for this user. You need to turn on Back to My Mac on all the computers you want to access.";

/* BTMM Status Strings */
"BTMM_STATUS_NOT_INITIALIZED" = "Back to My Mac isn’t working properly, and no additional information is available. Try force-quitting the Finder, and turning sharing services off and then back on.";
"BTMM_STATUS_DOUBLE_NAT" = "Back to My Mac isn’t working properly because you may have more than one device on your network providing Network Address Translation (NAT). Try disabling NAT on one of the devices.";
"BTMM_STATUS_NO_ROUTER" = "Back to My Mac isn’t working properly because you’re not connected to the Internet.";
"BTMM_STATUS_NO_NETWORK" = "Back to My Mac can’t be started because you’re not connected to the Internet.";
"BTMM_STATUS_RESTARTING" = "NAT Port Mapping has been enabled. Please wait while your Apple wireless device restarts.";
"BTMM_STATUS_POLLING_MODE" = "Back to My Mac isn’t working properly because of a problem accessing MobileMe. A firewall or router may be preventing access, or the MobileMe server is temporarily unavailable.";
"BTMM_STATUS_NAT_TRAVERSAL" = "Back to My Mac can’t provide remote access to sharing services on this computer because it requires a router that supports NAT Port Mapping Protocol (NAT-PMP) or Universal Plug and Play (UPnP). Make sure your router supports one of these protocols and that it is enabled.";
"BTMM_STATUS_NOT_RUNNING" = "Back to My Mac isn’t working properly because the Bonjour system service isn’t running.";
"BTMM_STATUS_NO_AUTH" = "Back to My Mac isn’t working properly because MobileMe didn’t accept your password.  Try signing out of MobileMe and then sign back in.  If you recently changed your MobileMe password, make sure to use your new password.";
"BTMM_STATUS_NO_SUCH_RECORD" = "Back to My Mac isn’t working properly because your DNS server isn’t responding.  Contact your Internet Service Provider for an alternate DNS server address, and then enter it in Network preferences.";
"BTMM_STATUS_NAT_PMP_DISABLED" = "Back to My Mac can’t provide remote access to sharing services on this computer because your router has NAT Port Mapping Protocol (NAT-PMP) disabled.";
"BTMM_STATUS_FIREWALL_BLOCKED" = "Back to My Mac is on, but the firewall settings prevent you from remotely accessing this computer.  Open Security preferences and change the firewall settings to allow incoming connections to the services you want to use.";
"STATUS_HELP_BUTTON" = "More Info…";
"ENABLE_PORT_MAPPING" = "Enable NAT Port Mapping…";
"SECURITY_BUTTON" = "Open Security…";

/* BTMM Failure strings */
"CLIENT_FAILURE_TITLE" = "Unable to start Back to My Mac";
"CLIENT_FAILURE_MESSAGE" = "Sign out, sign back in, and try again. If this problem persists, restart your computer.";

"SERVER_FAILURE_TITLE" = "Unable to start Back to My Mac";
"SERVER_FAILURE_MESSAGE" = "Back to My Mac could not start because of a %@ server error. Try again later. If this problem persists, contact %@ Support.";
"SERVER_FAILURE_ALERT_ALTERNATE_BUTTON" = "%@ Support";
"SERVER_FAILURE_SUPPORT_URL" = "http://www.apple.com/support/mobileme/"; /* must be localized */

/* BTMM Accessibility Strings */
"AX_DESCR_FOR_NSStatusUnknown" = "Status off indicator";
"AX_DESCR_FOR_NSStatusAvailable" = "Status on indicator";
"AX_DESCR_FOR_NSStatusAway" = "Status error indicator";
"AX_DESCR_FOR_NSStatusIdle" = "Status warning indicator";


/* name/password validation strings. these appear under the password field in the Accounts tab. */
"PASSWORD_VALID" = "Password valid";
"PASSWORD_INVALID" = "Name or password invalid";
"UNKNOWN_VALIDATION" = "Unknown validation error";
"CRED_VALIDATION_SERVER_ERROR" = "Server not found";

/* Sync strings */
"SYNC_LOGIN_FAILED_TITLE" = "Unable to log in to the %@ synchronization server";
"SYNC_LOGIN_FAILED_MESSAGE" = "Please check your network and account settings, then try again.";
"SYNC_LOGIN_FAILED_SET_UP_ACCOUNT_BUTTON" = "Set up account";
"SYNC_LOGIN_FAILED_CANCEL_BUTTON" = "Cancel";
"SYNC_DISABLED_TITLE" = "Syncing is Disabled";
"SYNC_DISABLED_MESSAGE" = "Syncing is currently disabled. Enable syncing in the %@ Sync tab and try again.";
"SYNC_DISABLED_PROMPT" = "Syncing is currently disabled on this computer. Would you like to enable it?";
"SYNC_REGISTER_CONFLICT_TITLE" = "A computer named \"%@\" is already registered with the %@ synchronization server.";
"SYNC_REGISTER_CONFLICT_MESSAGE" = "If you use the same name for two different computers you may lose your synchronized information on all registered computers and devices.\n\nYou can safely reuse a previously registered name if you are sure it is the only computer now using this name under your %@ account.";
"SYNC_UNKNOWN_ERROR_TITLE" = "There was a problem with the sync operation";
"SYNC_UNKNOWN_ERROR_MESSAGE" = "An unknown error occurred while performing a sync operation. Please check your account and network settings, then try again.";
"SYNC_REGISTER_CONFLICT_ENTER_ANOTHER_NAME" = "Enter another name";
"SYNC_REGISTER_CONFLICT_USE_SAME_NAME" = "Use same name";
"SYNC_REGISTER_CONFLICT_CANCEL" = "Cancel";
"NEVER SYNCHRONIZED" = "Never Synchronized";
"REPLACE_INFO_FROM_DOT_MAC" = "Replace %@ on this computer with sync information from %@.";
"REPLACE_INFO_FROM_THIS_COMPUTER" = "Replace %@ on %@ with sync information from this computer.";
"INFO_FROM_DOT_MAC" = "On this computer with sync info from %@.";
"INFO_FROM_THIS_COMPUTER" = "On %@ with sync info from this computer.";
"UNREGISTER_SYNC_CONFIRMATION_TITLE_SINGULAR" = "Are you sure you want to stop syncing the selected computer?";
"UNREGISTER_SYNC_CONFIRMATION_MESSAGE_SINGULAR" = "You will no longer be able to sync with \"%@\".";
"UNREGISTER_SYNC_CONFIRMATION_TITLE_PLURAL" = "Are you sure you want to stop syncing the selected computers?";
"UNREGISTER_SYNC_CONFIRMATION_MESSAGE_PLURAL" = "You will no longer be able to sync with the selected computers.";
"SYNC_REPLACE_DOT_MAC_CONFIRM_TITLE" = "Are you sure you want to replace data on %@ with data from this computer?";
"SYNC_REPLACE_COMPUTER_CONFIRM_TITLE" = "Are you sure you want to replace data on this computer with data from %@?";
"SYNC_REPLACE_CONFIRM_MESSAGE" = "This action cannot be undone.";
/* Appears in the advanced tab next to the name of this computer */
"THIS_COMPUTER" = "(This Computer)";
/* The "Sync Now" button changes title during a sync: */
"SYNC_NOW" = "Sync Now";
"CANCEL_SYNC" = "Cancel Sync";
/* The "Unregister" button in the Advanced tab changes: */
"UNREGISTER_SINGULAR" = "Stop Syncing Computer";
"UNREGISTER_PLURAL" = "Stop Syncing Computers";
"REGISTER_THIS_COMPUTER" = "Sync this Computer";

/* Sync progress status text */
"SYNC_PROGRESS_UNAVAILABLE" = "Sync Unavailable";
"SYNC_PROGRESS_SYNCING" = "Syncing %@…";
"SYNC_PROGRESS_GETTING" = "Getting %@ Info…";
"SYNC_PROGRESS_CANCELING" = "Canceling…";
"SYNC_PROGRESS_PREPARING_DOTMAC" = "Preparing %@ Sync…";
"SYNC_PROGRESS_SYNCING_DOTMAC" = "Syncing %@…";
"ADVANCED_REGISTERING_COMPUTER" = "Registering computer…";
"ADVANCED_UNREGISTERING_COMPUTER" = "Unregistering computer…";
"ADVANCED_PROGRESS_GETTNG" = "Getting list of registered computers…";
"ADVANCED_PROGRESS_UPDATING" = "Updating list of registered computers…";
"ADVANCED_PROGRESS_FAILED_GETTING" = "Failed to retrieve the list of registered computers…";
"FAILED_START_SYNC" = "Failed to start the sync...";
"FAILED_COMM_SYNC_SERVER" = "Failed to communicate with the local sync server, please try again later.";

/**/
"Sync Information Table" = "Sync Information Table";

/* High Level error messages */

/* For the text on the My Macs Tab */
"FILE_SHARING_ON" = "File Sharing: On";
"FILE_SHARING_OFF" = "File Sharing: Off";
"SCREEN_SHARING_ON" = "Screen Sharing: On";
"SCREEN_SHARING_OFF" = "Screen Sharing: Off";

"FILE_SHARING_TEXT" = "The files on \"%@\" can be accessed remotely from your other Macs.";
"SCREEN_SHARING_TEXT" = "Enable screen sharing to allow the desktop of \"%@\" to be viewed from your other Macs.";
"THIS_COMPUTER_NO_PARENS" = "This Computer";

/* Localizations from the Nibs */
/* Internet Pref*/
"SIGNED_IN_TEXT" = "Signed into %@";

"MEMBER_MESSAGE" = "Are you a %@ member?";
"MEMBER_INFO" = "Sign into your account to set up %@ on this computer.";
"TRIAL_MESSAGE" = "Try %@ for free.";
"TRIAL_INFO" = "Sign up now and experience %@ for 60 days at no charge.";

/* Password Sheet */
"PASSWORD_SHEET_INFO" = "If you have not changed your password (or had it reset), contact %@ Support.";

/* Advanced View */
"REGISTERED_COMPUTERS" = "The following computers are being synchronized using this %@ account:";
"RESET_SYNC_DATA" = "Reset Sync Data…";
"RESET_SYNC_HISTORY" = "Reset Sync History…";
"STOP_SYNCING_MESSAGE" = "Stop Syncing Computer…";

/* DeleteDataClassesPanel */
"DELETE_DATACLASSES_MESSAGE" = "Would you like to delete unused sync info from %@?";
"DELETE_DATACLASSES_INFO" = "Additional sync info has been found on the %@ server that is not synchronized by this computer. If this info is not being synced by another computer and you no longer need it, select any items you would like to delete from the %@ server below.";

/* Sync View */
"NEW_SYNCNAME_MESSAGE" = "Enter a name to identify this computer on the %@ synchronization server:";
"SYNC_TEXT" = "Synchronize with %@:";
